iarsystems/ewarm-nxp-example-projects/LPC18xx/LPC18xx/LPC1800CMSIS_revA/Examples/GPIO/Gpio_LedBlinky/Gpio_LedBlinky.c
/**********************************************************************
* $Id: Gpio_LedBlinky.c 28 2014-01-27 14:45:13Z danielru $		Gpio_LedBlinky.c	2012-02-28
*//**
* @file		Gpio_LedBlinky.c
* @brief	This example describes how to use GPIO to drive LEDs
* @version	1.0
* @date		28. Feb. 2012
* @author	NXP MCU SW Application Team
*
* Copyright(C) 2012, NXP Semiconductor
* All rights reserved.
*
***********************************************************************
* Software that is described herein is for illustrative purposes only
* which provides customers with programming information regarding the
* products. This software is supplied "AS IS" without any warranties.
* NXP Semiconductors assumes no responsibility or liability for the
* use of the software, conveys no license or title under any patent,
* copyright, or mask work right to the product. NXP Semiconductors
* reserves the right to make changes in the software without
* notification. NXP Semiconductors also make no representation or
* warranty that such application will be suitable for the specified
* use without further testing or modification.
* Permission to use, copy, modify, and distribute this software and its
* documentation is hereby granted, under NXP Semiconductors'
* relevant copyright in the software, without fee, provided that it
* is used in conjunction with NXP Semiconductors microcontrollers.  This
* copyright, permission, and disclaimer notice must appear in all copies of
* this code.
**********************************************************************/
#include "lpc18xx_gpio.h"
#include "lpc18xx_scu.h"
#include "lpc18xx_libcfg.h"
#include "lpc18xx_cgu.h"


/* Example group ----------------------------------------------------------- */
/** @defgroup Gpio_LedBlinky	Gpio_LedBlinky
 * @ingroup GPIO_Examples
 * @{
 */


/************************** PRIVATE DEFINITIONS *************************/
#define LED1_BIT				1 //LEDUSB
#define LED1_PORT				4

#define RGB_LED_RED_BIT			5
#define RGB_LED_RED_PORT		7
#define RGB_LED_GREEN_BIT		6
#define RGB_LED_GREEN_PORT		7
#define RGB_LED_BLUE_BIT		8
#define RGB_LED_BLUE_PORT		7

/************************** PRIVATE VARIABLES *************************/
uint32_t msec;


/************************** PRIVATE FUNCTIONS *************************/
void SysTick_Handler (void) ;


/*----------------- INTERRUPT SERVICE ROUTINES --------------------------*/
/*********************************************************************//**
 * @brief		SysTick handler sub-routine (1ms)
 * @param[in]	None
 * @return 		None
 **********************************************************************/
void SysTick_Handler (void) 					// SysTick Interrupt Handler @ 1000Hz
{
	if(msec)msec--;
}


/*-------------------------MAIN FUNCTION------------------------------*/
/*********************************************************************//**
 * @brief		Main program body
 * @param[in]	None
 * @return 		int
 **********************************************************************/
uint32_t tempx, tempy;

int c_entry (void) {                       /* Main Program                       */

	uint8_t tmp = 0;
	SystemInit();
	CGU_Init();

	scu_pinmux(0x8 ,1 , MD_PDN, FUNC0); 	// P8.1 : USB0_IND1 LED
	scu_pinmux(0xE ,5 , MD_PDN, FUNC4);//R-7[5]
	scu_pinmux(0xE ,6 , MD_PDN, FUNC4);//G-7[6]
	scu_pinmux(0xE ,8 , MD_PDN, FUNC4);//B-7[8]

	GPIO_SetDir(LED1_PORT,(1<<LED1_BIT), 1);
	GPIO_SetDir(RGB_LED_RED_PORT,(1<<RGB_LED_RED_BIT), 1);
	GPIO_SetDir(RGB_LED_GREEN_PORT,(1<<RGB_LED_GREEN_BIT), 1);
	GPIO_SetDir(RGB_LED_BLUE_PORT,(1<<RGB_LED_BLUE_BIT), 1);

	// M3Frequency is automatically set when SetClock(BASE_M3_CLK... was called.
	SysTick_Config(CGU_GetPCLKFrequency(CGU_PERIPHERAL_M3CORE)/1000);  				// Generate interrupt @ 1000 Hz

	while (1)
	{                           					// Loop forever
		msec = 500;
		while(msec);
		GPIO_ClearValue(LED1_PORT,(1<<LED1_BIT));
		msec = 500;
		while(msec);
		GPIO_SetValue(LED1_PORT,(1<<LED1_BIT));
		if (tmp&0x1)
			GPIO_SetValue(RGB_LED_RED_PORT,(1<<RGB_LED_RED_BIT));
		else GPIO_ClearValue(RGB_LED_RED_PORT,(1<<RGB_LED_RED_BIT));
		if (tmp&0x2)
			GPIO_SetValue(RGB_LED_GREEN_PORT,(1<<RGB_LED_GREEN_BIT));
		else GPIO_ClearValue(RGB_LED_GREEN_PORT,(1<<RGB_LED_GREEN_BIT));
		if (tmp&0x4)
			GPIO_SetValue(RGB_LED_BLUE_PORT,(1<<RGB_LED_BLUE_BIT));
		else GPIO_ClearValue(RGB_LED_BLUE_PORT,(1<<RGB_LED_BLUE_BIT));
		if (++tmp == 8) tmp = 0;
	}
}


/* With ARM and GHS toolsets, the entry point is main() - this will
   allow the linker to generate wrapper code to setup stacks, allocate
   heap area, and initialize and copy code and data segments. For GNU
   toolsets, the entry point is through __start() in the crt0_gnu.asm
   file, and that startup code will setup stacks and data */
int main(void)
{
    return c_entry();
}

#ifdef  DEBUG
/*******************************************************************************
* @brief		Reports the name of the source file and the source line number
* 				where the CHECK_PARAM error has occurred.
* @param[in]	file Pointer to the source file name
* @param[in]    line assert_param error line source number
* @return		None
*******************************************************************************/
void check_failed(uint8_t *file, uint32_t line)
{
	/* User can add his own implementation to report the file name and line number,
	 ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

	/* Infinite loop */
	while(1);
}
#endif

/**
 * @}
 */
